In [51]:
import pandas as pd
import numpy as np

In [19]:
data = { 'name' : ['dipanshu1','dipanshu2','dipanshu3'],
        'roll_no' : [1,2,3],
        'marks' : [92,93,91]
       }

In [20]:
df1 = pd.DataFrame(data)

In [21]:
df1

        name  roll_no  marks
0  dipanshu1        1     92
1  dipanshu2        2     93
2  dipanshu3        3     91

# 1.Setting up indexes

In [22]:
df2 = pd.DataFrame(data,index = data['name'])

In [23]:
df2

                name  roll_no  marks
dipanshu1  dipanshu1        1     92
dipanshu2  dipanshu2        2     93
dipanshu3  dipanshu3        3     91

# 2.Extracting Info

In [24]:
df2

                name  roll_no  marks
dipanshu1  dipanshu1        1     92
dipanshu2  dipanshu2        2     93
dipanshu3  dipanshu3        3     91

In [25]:
df1

        name  roll_no  marks
0  dipanshu1        1     92
1  dipanshu2        2     93
2  dipanshu3        3     91

In [26]:
df1.loc[0]

name       dipanshu1
roll_no            1
marks             92
Name: 0, dtype: object

In [27]:
df2.loc["dipanshu1"]

name       dipanshu1
roll_no            1
marks             92
Name: dipanshu1, dtype: object

In [29]:
df2.iloc[:,-1] # all rows for last column

dipanshu1    92
dipanshu2    93
dipanshu3    91
Name: marks, dtype: int64

In [31]:
df2.iloc[2,2] #second row and second

91

In [32]:
df2.iloc[0:1, 0:2]

                name  roll_no
dipanshu1  dipanshu1        1

# 3. CSV file

In [33]:
#csv = comma separated values
df = pd.read_csv("iris_dataset.csv")

In [35]:
df.head(5)

   sepal_len  sepal_wid  petal_len  petal_width
0        5.1        3.5        1.4          0.2
1        4.9        3.0        1.4          0.2
2        4.7        3.2        1.3          0.2
3        4.6        3.1        1.5          0.2
4        5.0        3.6        1.4          0.2

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sepal_len    26 non-null     float64
 1   sepal_wid    26 non-null     float64
 2   petal_len    26 non-null     float64
 3   petal_width  26 non-null     float64
dtypes: float64(4)
memory usage: 964.0 bytes

In [37]:
df.describe()

       sepal_len  sepal_wid  petal_len  petal_width
count  26.000000  26.000000  26.000000    26.000000
mean    5.026923   3.461538   1.465385     0.246154
std     0.392487   0.373178   0.195841     0.102882
min     4.300000   2.900000   1.000000     0.100000
25%     4.800000   3.125000   1.400000     0.200000
50%     5.000000   3.400000   1.500000     0.200000
75%     5.325000   3.700000   1.575000     0.300000
max     5.800000   4.400000   1.900000     0.500000

# 4. Data accessing

In [42]:
df.iloc[0:5,1] #sepal width column and first five values

0    3.5
1    3.0
2    3.2
3    3.1
4    3.6
Name: sepal_wid, dtype: float64

In [43]:
df['sepal_wid'][0:5]

0    3.5
1    3.0
2    3.2
3    3.1
4    3.6
Name: sepal_wid, dtype: float64

In [45]:
df[['sepal_wid']][0:5] #in the form of a dataframe

   sepal_wid
0        3.5
1        3.0
2        3.2
3        3.1
4        3.6

In [47]:
df[['sepal_wid','sepal_len']].head(5)

   sepal_wid  sepal_len
0        3.5        5.1
1        3.0        4.9
2        3.2        4.7
3        3.1        4.6
4        3.6        5.0

In [49]:
df.iloc[:5,[1,3]]  #specific columns

   sepal_wid  petal_width
0        3.5          0.2
1        3.0          0.2
2        3.2          0.2
3        3.1          0.2
4        3.6          0.2

# 5. Missing Values

In [52]:
data = { 'name' : ['dipanshu1','dipanshu2','dipanshu3'],
        'roll_no' : [1,2,3],
        'marks' : [np.nan,93,91]
       }

In [53]:
df1 = pd.DataFrame(data)

In [54]:
df1

        name  roll_no  marks
0  dipanshu1        1    NaN
1  dipanshu2        2   93.0
2  dipanshu3        3   91.0

In [56]:
 df1.isnull()

    name  roll_no  marks
0  False    False   True
1  False    False  False
2  False    False  False

In [59]:
df1.isnull().sum() #total number of null values

name       0
roll_no    0
marks      1
dtype: int64

In [60]:
df2 = df1.fillna(1)

In [61]:
df2

        name  roll_no  marks
0  dipanshu1        1    1.0
1  dipanshu2        2   93.0
2  dipanshu3        3   91.0

In [63]:
# drop null values, remove entire row
df1.dropna(axis = 0)

        name  roll_no  marks
1  dipanshu2        2   93.0
2  dipanshu3        3   91.0

In [65]:
df1.dropna(axis=1) #drop column with null values

        name  roll_no
0  dipanshu1        1
1  dipanshu2        2
2  dipanshu3        3

In [69]:
pd.notnull(df1) #MARK TRUE NON NULL VALUES

   name  roll_no  marks
0  True     True  False
1  True     True   True
2  True     True   True

In [74]:
x=pd.notnull(df1['marks'])
x

0    False
1     True
2     True
Name: marks, dtype: bool

In [75]:
df1[x]

        name  roll_no  marks
1  dipanshu2        2   93.0
2  dipanshu3        3   91.0

# 6. Statistics Values

In [2]:
import pandas as pd
import numpy as np
data = { 'name' : ['dipanshu1','dipanshu2','dipanshu3'],
        'roll_no' : [1,2,3],
        'marks' : [np.nan,93,91]
       }

In [3]:
data

{'name': ['dipanshu1', 'dipanshu2', 'dipanshu3'],
 'roll_no': [1, 2, 3],
 'marks': [nan, 93, 91]}

In [4]:
df1 = pd.DataFrame(data)
df1

        name  roll_no  marks
0  dipanshu1        1    NaN
1  dipanshu2        2   93.0
2  dipanshu3        3   91.0

In [5]:
df1['marks'].sum()

184.0

In [6]:
df1['marks'].mean()

92.0

In [7]:
df1['marks'].cumsum()

0      NaN
1     93.0
2    184.0
Name: marks, dtype: float64

In [10]:
df1['marks'].count()

2

In [11]:
df1['marks'].min()

91.0

In [12]:
df1['marks'].max()

93.0

In [13]:
df1['marks'].var()

2.0

In [14]:
df1['marks'].std()

1.4142135623730951

In [20]:
df1 = df1[['marks','roll_no']]
df1

   marks  roll_no
0    NaN        1
1   93.0        2
2   91.0        3

In [21]:
df1.corr()

         marks  roll_no
marks      1.0     -1.0
roll_no   -1.0      1.0